In [2]:
import pandas as pd
import numpy as np

In [4]:
path = r'archive/final.csv'
df = pd.read_csv(path)

In [25]:
df.head()

   index  runs  opponent        ground       date match  Match_No  total
0      0    12  SriLanka      Dambulla  18Aug2008   ODI         1     12
1      1    37  SriLanka      Dambulla  20Aug2008   ODI         2     49
2      2    25  SriLanka  Colombo(RPS)  24Aug2008   ODI         3     74
3      3    54  SriLanka  Colombo(RPS)  27Aug2008   ODI         4    128
4      4    31  SriLanka  Colombo(RPS)  29Aug2008   ODI         5    159

In [8]:
df.describe()

            index        runs    Match_No         total
count  516.000000  516.000000  516.000000    516.000000
mean   270.118217   45.947674  258.500000  11681.726744
std    155.219618   44.584372  149.100637   7301.114849
min      0.000000    0.000000    1.000000     12.000000
25%    134.750000   11.000000  129.750000   5328.250000
50%    270.500000   32.500000  258.500000  10886.500000
75%    403.250000   70.250000  387.250000  18535.750000
max    539.000000  254.000000  516.000000  23709.000000

#### Max scoring match

In [18]:
max_id = df['runs'].idxmax()
print(df.loc[max_id])

index               453
runs                254
opponent    SouthAfrica
ground             Pune
date          10Oct2019
match              Test
Match_No            435
total             21024
Name: 434, dtype: object

#### Min scoring match

In [20]:
min_id = df['runs'].idxmin()
print(df.loc[min_id])

index              23
runs                0
opponent     Zimbabwe
ground       Bulawayo
date        28May2010
match             ODI
Match_No           21
total             847
Name: 20, dtype: object

In [24]:
df['runs'].value_counts()

0      32
9      15
1      14
2      13
3      12
       ..
211     1
154     1
167     1
235     1
73      1
Name: runs, Length: 142, dtype: int64

In [29]:
df['ground'].value_counts()

Mirpur               23
Kolkata              18
Ahmedabad            17
Sydney               17
Bengaluru            17
                     ..
Bristol               1
Brabourne             1
Providence            1
Roseau                1
Chester-le-Street     1
Name: ground, Length: 73, dtype: int64